docs/informe.md
```mermaid
sequenceDiagram
    participant C as cliente@P2
    participant R as restaurante@P1
    participant L as logistica@P1
    participant P as pagos@P2
    participant S as supervisor@P1

    C->>R: CFP (orderId, items)
    R-->>C: PROPOSE (total, prepMins)
    C->>R: ACCEPT_PROPOSAL
    C->>L: REQUEST entrega (prepMins, zona)
    L-->>C: INFORM (eta, deliveryCost, route)
    C->>P: REQUEST pago (amount, deliveryFee)
    alt Pago aprobado
        P-->>C: CONFIRM
        C->>R: INFORM order CONFIRMED
        C->>S: INFORM ORDER_COMPLETED
    else Pago rechazado
        P-->>C: FAILURE
        C->>S: INFORM PAYMENT_REJECTED
    end
```
